app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."published" = 't')
---
  def index
    if session[:user_id].nil? # if not logged in
    @posts = Post.all_published
    else
      @posts = Post.all.reverse

INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "published") VALUES('2009-10-22 15:26:25', 'Welcome to Camcudaf', ' CAMCUDAF is a non-profit making, non-violent and non-partisan association which serves the needs and provides information for citizens of Cameroon living in Finland as well as friends of Cameroon interested in learning about our culture and way of life. With the number of Cameroonians in Finland growing each year CAMCUDAF is well situated to provide first hand information to its members and well-wishers.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "updated_at" = '2009-10-20 07:51:25', "body" = 'In my first learning dairy, i mentioned the following problems: i had prob-lems with most especially programming and i did not make a pass grade. i also had some problems with my jobs, i was for long hours every day and as a consequence, i was always tired. I did make mention of the fact that i considered the degree program easy and i was not taking my studies seri-ously and spent very little time studying. Let’s stop at these few. As early as the last semester ended, i made my resolution regarding my studies and life style. ' WHERE "id" = 2
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])