app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = -620101748)
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("salt", "address", "created_at", "updated_at", "repassword", "hashed_password", "lastname", "firstname", "phone", "email") VALUES('460bb725c7e80e137e889d0d900be9ce6bf339d839f562a13be7cb0286f87743', 'takojabtie 4, espoo', '2009-10-26 17:06:16', '2009-10-26 17:06:16', 'narcisse', 'e28508598544dbb394973ccb2bd5bf2f426b48aad1f7d4d804f0cb9085f83c25', 'narcisse', 'opu', '0449412633', 'opunarcisse@gmail.it')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "phone" = '044 57733 333', "lastname" = 'Narcisse', "updated_at" = '2009-11-16 08:41:58', "email" = 'narcisse@hh.com', "salt" = '1ee1cb60f8007a6a6694cebe6f07d437623f84b8654148b76d6546f66d0c477e', "firstname" = 'opu', "hashed_password" = 'bb6aa8bfa8af8012eceb2f58292cfcdb95c5e3cc672e453c1882d8083a0ea919', "repassword" = 'Programmer1228', "address" = 'Rasinkatu 7C 083' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])